# Naive Bayes: Predicting survival from titanic crash

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [5]:
#inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})

In [6]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [7]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

Let's drop sex column because it is redundant

In [8]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [9]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [10]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [16]:
inputs_any = inputs.isnull().sum()
inputs_any

Pclass      0
Age       177
Fare        0
female      0
dtype: int64

In [18]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(10)

   Pclass        Age     Fare  female
0       3  22.000000   7.2500       0
1       1  38.000000  71.2833       1
2       3  26.000000   7.9250       1
3       1  35.000000  53.1000       1
4       3  35.000000   8.0500       0
5       3  29.699118   8.4583       0
6       1  54.000000  51.8625       0
7       3   2.000000  21.0750       0
8       3  27.000000  11.1333       1
9       2  14.000000  30.0708       1

In [20]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split (inputs, target, test_size = 0.3)

In [21]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [26]:
model.fit(X_train,y_train)
params = model.get_params()
print(model)
params

GaussianNB()

{'priors': None, 'var_smoothing': 1e-09}

In [27]:
model.score(X_test,y_test)

0.746268656716418

In [28]:
X_test[0:10]

     Pclass        Age      Fare  female
811       3  39.000000   24.1500       0
77        3  29.699118    8.0500       0
714       2  52.000000   13.0000       0
1         1  38.000000   71.2833       1
311       1  18.000000  262.3750       1
262       1  52.000000   79.6500       0
248       1  37.000000   52.5542       0
120       2  21.000000   73.5000       0
180       3  29.699118   69.5500       1
506       2  33.000000   26.0000       1

In [29]:
y_test[0:10]

811    0
77     0
714    0
1      1
311    1
262    0
248    1
120    0
180    0
506    1
Name: Survived, dtype: int64

In [30]:
model.predict(X_test[0:10])

array([0, 0, 0, 1, 1, 1, 0, 0, 1, 1], dtype=int64)

In [31]:
model.predict_proba(X_test[:10])

array([[9.71027579e-01, 2.89724211e-02],
       [9.70477810e-01, 2.95221899e-02],
       [9.35917293e-01, 6.40827070e-02],
       [2.65994471e-02, 9.73400553e-01],
       [3.32143297e-14, 1.00000000e+00],
       [3.66674564e-01, 6.33325436e-01],
       [7.02135060e-01, 2.97864940e-01],
       [7.42481011e-01, 2.57518989e-01],
       [1.82164097e-01, 8.17835903e-01],
       [2.87614009e-01, 7.12385991e-01]])